In [72]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [73]:
df_train = pd.read_csv("training_titanic_x_y_train.csv")

In [74]:
df_train.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,2,"Weisz, Mrs. Leopold (Mathilde Francoise Pede)",female,29.0,1,0,228414,26.000,NaN,S,1
1,3,"Williams, Mr. Howard Hugh ""Harry""",male,NaN,0,0,A/5 2466,8.050,NaN,S,0
2,2,"Morley, Mr. Henry Samuel (""Mr Henry Marshall"")",male,39.0,0,0,250655,26.000,NaN,S,0
3,3,"Palsson, Mrs. Nils (Alma Cornelia Berglund)",female,29.0,0,4,349909,21.075,NaN,S,0
4,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.050,NaN,S,0

In [75]:
df_test = pd.read_csv("test_titanic_x_test.csv")

In [76]:
df_train = df_train.drop(labels = ["Name", "Cabin", "Ticket"], axis=1)

In [77]:
df_train = pd.get_dummies(df_train, columns=['Sex', 'Embarked'])

In [79]:
df_train['Age'] = df_train['Age'].fillna(df_train['Age'].mean())

In [80]:
df_train.head()

,Pclass,Age,SibSp,Parch,Fare,Survived,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,2,29.00000,1,0,26.000,1,1,0,0,0,1
1,3,29.70056,0,0,8.050,0,0,1,0,0,1
2,2,39.00000,0,0,26.000,0,0,1,0,0,1
3,3,29.00000,0,4,21.075,0,1,0,0,0,1
4,3,25.00000,0,0,7.050,0,0,1,0,0,1

In [81]:
df2 = df_train["Survived"]

In [82]:
df2.head()

0    1
1    0
2    0
3    0
4    0
Name: Survived, dtype: int64

In [83]:
df1 = df_train.drop(labels = ["Survived"], axis=1)

In [84]:
df1.head()

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,2,29.00000,1,0,26.000,1,0,0,0,1
1,3,29.70056,0,0,8.050,0,1,0,0,1
2,2,39.00000,0,0,26.000,0,1,0,0,1
3,3,29.00000,0,4,21.075,1,0,0,0,1
4,3,25.00000,0,0,7.050,0,1,0,0,1

In [85]:
from sklearn.linear_model import LogisticRegression

In [86]:
ls = LogisticRegression()

In [87]:
ls.fit(df1, df2)

C:\Users\Home\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:814: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [88]:
df_test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S
1,1,"Leader, Dr. Alice (Farnham)",female,49.0,0,0,17465,25.9292,D17,S
2,3,"Kilgannon, Mr. Thomas J",male,NaN,0,0,36865,7.7375,NaN,Q
3,2,"Jacobsohn, Mrs. Sidney Samuel (Amy Frances Chr...",female,24.0,2,1,243847,27.0000,NaN,S
4,1,"McGough, Mr. James Robert",male,36.0,0,0,PC 17473,26.2875,E25,S

In [89]:
df_test = df_test.drop(labels = ["Name", "Cabin", "Ticket"], axis=1)

In [90]:
df1.shape

(668, 10)

In [91]:
df2.shape

(668,)

In [92]:
df_test = pd.get_dummies(df_test, columns=['Sex', 'Embarked'])

In [93]:
df_test.shape

(223, 10)

In [94]:
df_test = df_test.fillna(df_test.mean())

In [96]:
df_test.shape

(223, 10)

In [98]:
predictions = ls.predict(df_test)

In [99]:
predictions

array([0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       1, 0, 0], dtype=int64)

In [100]:
predictions.shape

(223,)

In [104]:
predictions_int = predictions.astype(int)
np.savetxt("predictions_titanic_CN.csv", predictions_int, delimiter=",")